[
  {
    "articleId": "565146916519136149",
    "articleTitle": "UI team training",
    "articleContent": "Training for Front End memebersFor the big picture Reading Head First Servlets and JSPReading Java for Dummies (Optional)Creating portlets (To see what a portlet is, just the main concepts, but well founded, what is behind the scenes) Learning JavaScript Learning what are the bases of JavaScript in Liferay Portal Debugging with chromeCapturing requests/responses Identifying the portal source (Java and or javascript/FTL/etc) based on a spot/error message/etc in the browser Solving all the tasks here..",
    "articleUrl": "https://grow.liferay.com/share/UI+team+training",
    "authorName": "Péter Borkuti",
    "authorUrl": "https://grow.liferay.com/web/peter.borkuti",
    "authorPic": "http://placehold.it/75",
    "view": 250
  },
  {
    "articleId": "565146916519156449",
    "articleTitle": "Front-End Infrastructure skill map - 7.1",
    "articleContent": "This skill map prepares you to understand the internals of the Front-End infrastructure components in Liferay 7.1. Given that this topic is complex, other skills are also included, related to fundamental front-end knowledge which is required to understand FEI elements. Table of contents Front-End Concepts and Technologies Foundational Front-End building blocks skill map The three essential aspects & technologies of web development skill map Other technologies in web development skill map Cross-cutting",
    "articleUrl": "https://grow.liferay.com/share/Front-End+Infrastructure+skill+map+-+7.1",
    "authorName": "Daniel Sanz",
    "authorUrl": "https://grow.liferay.com/web/daniel.sanz",
    "authorPic": "http://placehold.it/75",
    "view": 290
  },
  {
    "articleId": "56514691647169136149",
    "articleTitle": "/928631",
    "articleContent": "Support Planning Contributors 43 Updated by Nicole Mak Jun 29, 2018 Creator Zsolt Balogh (2) Jan 19, 2018 Nicole Mak (1) View history Tags commerce Pages Comments",
    "articleUrl": "https://grow.liferay.com/share/%3CSLASH%3E928631",
    "authorName": "Nicole Mak",
    "authorUrl": "https://grow.liferay.com/web/nicole.mak",
    "authorPic": "http://placehold.it/75",
    "view": 320
  },
  {
    "articleId": "565146917899136149",
    "articleTitle": " Traveling Process in Hungary - Traveling from Hungary",
    "articleContent": "^Travelling With Liferay Table of Contents [-] Before the trip General - Do not forget... VISAs and travel documents To the USA as a Hungarian Citizen Insurances Booking flight tickets - Hungary ExpensesWhat is cov ered by Liferay on a trip? Invoices Food & Drink Other Car rental Taxi Using your own car How to request pre-payment before travelling? Reimbursement steps Before the Get your direct managers approval for the trip. Check VISA and other travel requirements for the destination and take care of these.",
    "articleUrl": "https://grow.liferay.com/share/Traveling+Process+in+Hungary+-+Traveling+from+Hungary",
    "authorName": "Zsolt Balogh",
    "authorUrl": "https://grow.liferay.com/web/zsolt.balogh",
    "authorPic": "http://placehold.it/75",
    "view": 410
  },
  {
    "articleId": "565171468264698425149",
    "articleTitle": "Handling hypoglycemia (low blood glucose) by type 1 diabetes",
    "articleContent": "This document contains instructions how to handle low blood sugar low blood glucose in case of type 1 diabetes. Im writing this article first of all for my colleagues in the Budapest Office, but instructions below can be used anywhere.  What to do If the person still can swallow, even if cant communicate properly anymore: Give her/him something which contains a lot of sugar: 1) White sugar 2) 100% Orange or other fruit juice 3) Coke or any other soda (not light) Please avoid artificial sweeten",
    "articleUrl": "https://grow.liferay.com/share/Handling+hypoglycemia+%3COPEN_PARENTHESIS%3Elow+blood+glucose%3CCLOSE_PARENTHESIS%3E+by+type+1+diabetes",
    "authorName": "Péter Wagner",
    "authorUrl": "https://grow.liferay.com/web/peter.wagner",
    "authorPic": "http://placehold.it/75",
    "view": 500
  },
  {
    "articleId": "465146916519136149",
    "articleTitle": "ImageMagick Install and Setup Guide for Linux",
    "articleContent": "This is a guide on how to install ImageMagick, along with Ghostscript in a Linux environment from source. This is particularly useful because of an issue with PDFBox. Resolution Once we have installed ImageMagick and Ghostscript, we will set Liferay up to use them to generate previews and check the common errors Note: ImageMagick needs DeleGate to work properly. In order for IM to convert a pdf to png it will need the libraries for the png, also called the Delegate for png. Without it, IM will not work",
    "articleUrl": "http://www.charactercountonline.com/",
    "authorName": "Anna Rynkiewicz",
    "authorUrl": "https://grow.liferay.com/web/anna.rynkiewicz",
    "authorPic": "http://placehold.it/75",
    "view": 550
  },
  {
    "articleId": "135146916519136149",
    "articleTitle": "LESA: Email Notification Settings for Account Watchers",
    "articleContent": "Creator:  Justin Choi  May 25, 2018 Here is how to configure email notifications for subscribers with Watchers. Users with the Watcher role have view-only permissions on LESA tickets. Subscribers have raised the concern that they are getting too many email notifications and instead would like to determine which email notifications they would receive. Only Watchers have access to this functionality while all",
    "articleUrl": "https://grow.liferay.com/share/LESA%3CCOLON%3E+Email+Notification+Settings+for+Account+Watchers",
    "authorName": "Anna Rynkiewicz",
    "authorUrl": "https://grow.liferay.com/web/anna.rynkiewicz",
    "authorPic": "http://placehold.it/75",
    "view": 600
  },
  {
    "articleId": "225146916519136149",
    "articleTitle": "GROW FEATURE SET",
    "articleContent": "Category nodes People, Learn, Excellence, Share Create new page - Supported formats Plain text, Creole, Markdown, HTML Edit any page Editing formats - Supported formats: Plain text, Creole, Markdown, HTML Subscribe/ Unsubscribe - get email notification on article changes When you create a wiki page the auto subscribe to that article is working. Write comments - Give feedback!  If you aren’t sure, give opinion! Questions? @mention - send email notification by mentioning someone on comments. Give feedb",
    "articleUrl": "https://grow.liferay.com/share/GROW+FEATURE+SET",
    "authorName": "Anna Rynkiewicz",
    "authorUrl": "https://grow.liferay.com/web/anna.rynkiewicz",
    "authorPic": "http://placehold.it/75",
    "view":750
  },
  {
    "articleId": "165256816519136149",
    "articleTitle": "GROW ADVANCED HOW TO USE - self-learning training",
    "articleContent": "If you are interested in a instructor-led GROW ADVANCED HOW TO USE training, please check GROW ADVANCED HOW TO USE - instructor-led training Audience: GROW users Objective: After the training you will be able to... use GROW and get to know all the current GROW features Prerequisites: no skills, laptop needed GROW access is needed (just login once) successfully finishing the Online GROW basics training or the GROW basics - instructor-led training Type: Self-learning Group size: unlimited Length: 1,5 ho",
    "articleUrl": "https://grow.liferay.com/share/GROW+ADVANCED+HOW+TO+USE+-+self-learning+training",
    "authorName": "Anna Rynkiewicz",
    "authorUrl": "https://grow.liferay.com/web/anna.rynkiewicz",
    "authorPic": "http://placehold.it/75",
    "view": 350
  },
  {
    "articleId": "915146916519136149",
    "articleTitle": "GROW ADVANCED HOW TO USE - instructor-led training",
    "articleContent": "Status: Ready Audience: GROW users Objective: After the training you will be able to... use GROW and get to know all the current GROW features Prerequisites: no skills, laptop needed GROW access is needed (just login once) successfully finishing the Online GROW basics training or the Grow basics - instructor-led training Type: Class presentation Group size: 2-6 ppl Length: 1,5 hours Authors: @anna.rynkiewicz Trainers: @anna.rynkiewicz Source: Training slides Feedback form: ????? Useful related links",
    "articleUrl": "https://grow.liferay.com/share/GROW+ADVANCED+HOW+TO+USE+-+instructor-led+training",
    "authorName": "Anna Rynkiewicz",
    "authorUrl": "https://grow.liferay.com/web/anna.rynkiewicz",
    "authorPic": "http://placehold.it/75",
    "view": 680
  },
  {
    "articleId": "54565146916519136149",
    "articleTitle": "New Search Portlets and Pages in 7.1",
    "articleContent": "◄ Liferay 7.1 Training ◄◄ Search 7.1 Trainings and Skill Ma#WIP | Epic: LPS-76358 [Table of Contents/Skill Map] Target Audience: Support All (everyone working on Search related components) L1: Understanding the New Search Portlets and Search Pages in 7.1 L2: Configuring the New Search Portlets and Search Pages in 7.1 L3: Troubleshooting and Analyzing Issues in the New Search Portlets and Search Pages in 7.1 L4: Fixing Issues in the New Search Portlets and Search Pages in 7.1 The page refers to ",
    "articleUrl": "https://grow.liferay.com/share/New+Search+Portlets+and+Pages+in+7.1",
    "authorName": "Tibor Lipusz",
    "authorUrl": "https://grow.liferay.com/web/tibor.lipusz",
    "authorPic": "http://placehold.it/75",
    "view": 420
  }
]
